In [1]:
import pandas as pd

In [2]:
data = {'Name': ['John', 'Emma', 'Tom', 'Emily', "North", "Seen"],
        'Age': [None, 28, 23, 27, 38, 38],
        'City': ['New York', 'San Francisco', 'London', 'Paris', 'BKK', 'BKK']}
df = pd.DataFrame(data)

df['Salary'] = [50000, 60000, 45000, 55000, 20000, 30000]  # Add a new column

df

    Name   Age           City  Salary
0   John   NaN       New York   50000
1   Emma  28.0  San Francisco   60000
2    Tom  23.0         London   45000
3  Emily  27.0          Paris   55000
4  North  38.0            BKK   20000
5   Seen  38.0            BKK   30000

In [3]:
# Dictionary
dict = df.to_dict() 
print(dict)

{'Name': {0: 'John', 1: 'Emma', 2: 'Tom', 3: 'Emily', 4: 'North', 5: 'Seen'}, 'Age': {0: nan, 1: 28.0, 2: 23.0, 3: 27.0, 4: 38.0, 5: 38.0}, 'City': {0: 'New York', 1: 'San Francisco', 2: 'London', 3: 'Paris', 4: 'BKK', 5: 'BKK'}, 'Salary': {0: 50000, 1: 60000, 2: 45000, 3: 55000, 4: 20000, 5: 30000}}

In [ ]:
# List
list = df['Salary'].to_list()
print(list)

In [ ]:
# Json
json = df.to_json()
print(json)

In [ ]:
# Html
html = df.to_html()
print(html)

In [ ]:
# Csv
df.to_csv('output.csv', index=False)

In [ ]:
df.head()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df['Name']

In [ ]:
df['Age'].mean()

In [ ]:
df['City'].unique()

In [ ]:
df['Age'].apply(lambda x: x + 1)

In [ ]:
df['Age'] > 25

In [ ]:
df[df['Age'] > 25]

In [ ]:
df[(df['Age'] > 25) & (df['City'] == 'BKK')]

In [ ]:
df.query("Age > 25 and City == 'BKK'")

In [ ]:
grouped_data = df.groupby('City')

In [ ]:
grouped_data['Age'].mean()

In [ ]:
grouped_data['Salary'].sum()

In [ ]:
print(df.isnull())

In [ ]:
df_dropna = df.dropna()
df_dropna

In [ ]:
df_fillna = df.fillna(0)
df_fillna

In [ ]:
df_fillna = df.fillna(df.mean(numeric_only=True))
df_fillna

In [ ]:
def categorize_age(age):
    if age < 30:
        return 'Young'
    elif age < 40:
        return 'Middle-aged'
    else:
        return 'Old'

In [ ]:
df['Age Category'] = df['Age'].apply(categorize_age)
df

In [ ]:
average_salary_by_city = df.groupby('City')['Salary'].mean()
average_salary_by_city

In [ ]:
df['City'] = pd.Categorical(df['City'])
df['City']

In [ ]:
grouped_data = df.groupby('City')['Salary'].mean()
grouped_data